[
  {
    "title": "Paradise",
    "author": "Abdulrazak Gurnah",
    "id": "8919230",
    "url": "https://westerncape.overdrive.com/media/8919230",
    "available_copies": 1,
    "owned_copies": 1,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "By the winner of the 2021 Nobel Prize in Literature A BBC RADIO 4 Book at Bedtime SHORTLISTED FOR THE BOOKER PRIZE _______________________ 'A poetic and vividly conjured book about Africa and the brooding power of the unknown' Independent on Sunday 'Gurnah evokes his world in poetic prose which is pure and lucid - a small paradise in itself ... The pleasures, sadnesses and losses in all the shining facets of this book are lingering and exquisite' Guardian 'An obliterated world is enthrallingly retrieved' Sunday Times _______________________ Born in East Africa, Yusuf has few qualms about the journey he is to make. It never occurs to him to ask why he is accompanying Uncle Aziz or why the trip has been organised so suddenly, and he does not think to ask when he will be returning. But the truth is that his 'uncle' is a rich and powerful merchant and Yusuf has been pawned to him to pay his father's debts. Paradise is a rich tapestry of myth, dreams and Biblical and Koranic tradition, the story of a young boy's coming of age against the backdrop of an Africa increasingly corrupted by colonialism and violence."
  },
  {
    "title": "Agatha Christie, The Lost Plays",
    "author": "Agatha Christie",
    "id": "3031632",
    "url": "https://westerncape.overdrive.com/media/3031632",
    "available_copies": 1,
    "owned_copies": 1,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "A triple bill of archive BBC radio dramas, believed lost for over half a century and only recently rediscovered. Butter in a Lordly Dish, written specially for radio in 1948, features Richard Williams as Sir Luke Enderby KC, whose infidelities lead him into trouble when he goes to meet his latest flame. Williams also stars as Hercule Poirot in Murder in the Mews, a 1955 adaptation of a short story. A young woman is found dead in her flat, the day after Guy Fawkes night. Did she die by her own hand, or someone else's? In Personal Call, also written specially for radio by Agatha Christie, a disturbing telephone call from a woman named Fay has consequences for both Richard Brent and his wife Pam. This 1960 production stars Ivan Brandt and Barbara Lott."
  },
  {
    "title": "The £199 Adventure",
    "author": "Agatha Christie",
    "id": "453669",
    "url": "https://westerncape.overdrive.com/media/453669",
    "available_copies": 1,
    "owned_copies": 1,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "A middle-aged man in search of adventure, Bobby Roberts answers an advert in The Times and is dispatched to Milan, to collect a harmless package from a scientist. However, he very soon gets caught up in a terrifying murder."
  },
  {
    "title": "Gliff",
    "author": "Ali Smith",
    "id": "10490215",
    "url": "https://westerncape.overdrive.com/media/10490215",
    "available_copies": 1,
    "owned_copies": 1,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "Brought to you by Penguin.O brave new world, that has such people in't.Once upon a time not very far from now, two children come home to find a line of wet red paint encircling the outside of their house.What does it mean?It's a truism of our time that it'll be the next generation who'll sort out our increasingly toxic world.What would that actually be like?In a state turned hostile, a world of insiders and outsiders, what things of the past can sustain them and what shape can resistance take?And what's a horse got to do with any of this?Gliff is a novel about how we make meaning and how we are made meaningless. With a nod to the traditions of dystopian fiction, a glance at the Kafkaesque, and a new take on the notion of classic, it's a moving and electrifying read, a vital and prescient tale of the versatility and variety deep-rooted in language, in nature and in human nature.©2025 Ali Smith (P)2025 Penguin Audio"
  },
  {
    "title": "The Ballad of Speedball Baby",
    "author": "Ali Smith",
    "id": "10032923",
    "url": "https://westerncape.overdrive.com/media/10032923",
    "available_copies": 1,
    "owned_copies": 1,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "A Stylist Magazine (UK) pick for Best New NonfictionA That Eric Alper pick for My Next ReadsThe Ballad of Speedball Baby is the thrilling, darkly hilarious, and heart-wrenchingly vulnerable story of Ali Smith's coming-of-age in '90s New York as she commits to the messy, exhilarating life of a musician and must survive the slings and arrows society reserves for women who refuse to comply.As an only child reeling from the demolition of her parents' toxic marriage, the New York City underground music scene offers a young Ali a different family of misfits and talented outsiders to belong to.She becomes the bass player for edgy band Speedball Baby, a decision that will take her around the world—from onstage at the legendary CBGBs to the red-light district of Amsterdam. She's often the only girl in a broken-down tour van, being strip-searched at the Croatian border, chased by lunatics, and navigating the seedy underbelly of a male-dominated music scene full of addiction, violence, and misogyny—all while keeping her sharp wit and dark humor intact.Rimmed with heavy black eyeliner and smelling faintly of cheap booze, The Ballad of Speedball Baby is a pulse-quickening, unpredictable ride through the '90s music scene—alternately terrifying, hilarious, and painfully evocative—as well as a love letter to the power of female solidarity."
  },
  {
    "title": "White Houses",
    "author": "Amy Bloom",
    "id": "9322870",
    "url": "https://westerncape.overdrive.com/media/9322870",
    "available_copies": 85,
    "owned_copies": 85,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "Lorena Hickok meets Eleanor Roosevelt in 1932 while reporting on Franklin Roosevelt's first presidential campaign. Having grown up worse than poor in South Dakota and reinvented herself as the most prominent woman reporter in America, \"Hick\", as she's known to her friends and admirers, is not quite instantly charmed by the idealistic, patrician Eleanor. But then, as her connection with the future first lady deepens into intimacy, what begins as a powerful passion matures into a lasting love, and a life that Hick never expected to have. She moves into the White House, where her status as \"first friend\" is an open secret, as are FDR's own lovers. After she takes a job in the Roosevelt administration, promoting and protecting both Roosevelts, she comes to know Franklin not only as a great president but as a complicated rival and an irresistible friend, capable of changing lives even after his death. Through it all, even as Hick's bond with Eleanor is tested by forces both extraordinary and common, and as she grows as a woman and a writer, she never loses sight of the love of her life. From Washington, D.C. to Hyde Park, from a little white house on Long Island to an apartment on Manhattan's Washington Square, Amy Bloom's new novel moves elegantly through fascinating places and times, written in compelling prose and with emotional depth, wit, and acuity."
  },
  {
    "title": "Diary of an Invasion",
    "author": "Andrey Kurkov",
    "id": "9791411",
    "url": "https://westerncape.overdrive.com/media/9791411",
    "available_copies": 67,
    "owned_copies": 67,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "One of the most important Ukrainian voices throughout the Russian invasion, the author of Death and the Penguin and Grey Bees collects his searing dispatches from the heart of Kyiv.This journal of the invasion, a collection of Andrey Kurkov's writings and broadcasts from Kyiv, is a remarkable record of a brilliant writer at the forefront of a twenty-first-century war. Andrey Kurkov has been a consistent satirical commentator on his adopted country of Ukraine. His most recent work, Grey Bees, is a dark foreshadowing of the devastation in the eastern part of Ukraine in which only two villagers remain in a village bombed to smithereens. The author has lived in Kyiv and in the remote countryside of Ukraine throughout the Russian invasion. He has also been able to fly to European capitals where he has been working to raise money for charities and to address crowded halls. Kurkov has been asked to write for every English newspaper, as also to be interviewed all over Europe. He has become an important voice for his people.Kurkov sees every video and every posted message, and he spends the sleepless nights of continuous bombardment of his city delivering the truth about this invasion to the world."
  },
  {
    "title": "A Passage North",
    "author": "Anuk Arudpragasam",
    "id": "7452954",
    "url": "https://westerncape.overdrive.com/media/7452954",
    "available_copies": 1,
    "owned_copies": 1,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "It begins with a message: a telephone call informing Krishan that his grandmother's former care-giver, Rani, has died in unexpected circumstances, at the bottom of a well in her village in the north, her neck broken by the fall. The news arrives on the heels of an email from Anjum, an activist he fell in love with four years earlier while living in Delhi, bringing with it the stirring of distant memories and desires. As Krishan makes the long journey by train from Colombo into the war-torn Northern Province for the funeral, so begins a passage into the soul of an island devastated by violence. Written with precision and grace, A Passage North is a poignant memorial for the missing and the dead, and a luminous meditation on time, consciousness, and the lasting imprint of the connections we make with others.\"Mesmerizing, political, intimate, unafraid – this is a superb novel.\" SUNJEEV SAHOTA, author of the Booker shortlisted The Year of the Runaways'Profound...hypnotic...Arudpragasam explores the desire for independence that enflamed the decades-long civil war...and the emotional scars that refuse to heal.' OBSERVER'An extraordinary and often illuminating novel.' FINANCIAL TIMES'I've rarely read something so exquisitely alive.' NAOISE DOLAN"
  },
  {
    "title": "The Road to the Country",
    "author": "Chigozie Obioma",
    "id": "10208202",
    "url": "https://westerncape.overdrive.com/media/10208202",
    "available_copies": 1,
    "owned_copies": 1,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "Brought to you by Penguin.FROM THE TWICE BOOKER-SHORTLISTED AUTHORLonglisted for the Dublin Literary Award, the Joyce Carol Oates Prize, and the New American Voices AwardNamed a Best Book of the Year by the Economist, Boston Globe, and Kirkus ReviewsWhen a country is torn apart by civil war, Kunle and Tunde are separated, each on opposite sides. Desperate to find his brother, Kunle's search becomes one of atonement, leading him to join an army and to fight in a war he barely understands. Amidst the chaos, he forms deep, lifelong friendships and falls in love. But his ultimate hope remains: to reunite with his family.An emotionally powerful masterpiece, Chigozie Obioma's odyssey of brotherhood, love, and extraordinary courage set against the backdrop of the Biafran War captures the essence of a young man's quest for redemption in a nation ablaze.'A major voice' SALMAN RUSHDIE'Remarkable' ALICE WALKER'A sweeping, heart-racing, mystical novel' NEW YORK TIMES'Chigozie Obioma is that rare thing: an original' WALL STREET JOURNAL'As much Bildungsroman as battle song' LONDON REVIEW OF BOOKS'A moving story of conflict, faith and fractured bonds, blending myth and realism with emotional power' iPAPER©2024 Chigozie Obioma (P)2024 Penguin Audio"
  },
  {
    "title": "My Name Is Lucy Barton",
    "author": "Elizabeth Strout",
    "id": "5225239",
    "url": "https://westerncape.overdrive.com/media/5225239",
    "available_copies": 1,
    "owned_copies": 1,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "Brought to you by Penguin.Presenting an original audiobook performance of the stage production of My Name Is Lucy Barton, starring Academy Award and Tony nominee Laura Linney.Praised as \"deeply affecting\" and \"heartbreaking\" by The Guardian (UK), this is a faithful adaptation of the Pulitzer Prize-winning author Elizabeth Strout's best-selling novel of the same name. Unsteady after an operation, Lucy Barton wakes to find her mother sitting at the foot of her bed. She hasn't seen her in years, and her visit brings back to Lucy her desperate rural childhood, and her escape to New York. As she begins to find herself as a writer, she is still gripped by the urgent complexities of family life.Published as the play comes to Broadway after a highly-acclaimed UK run in 2018, this is a unique opportunity to hear Laura Linney's \"simply superb\" (The Times UK) performance of this haunting, dramatic monologue.My Name Is Lucy Barton was originally produced by Nicholas Hytner and Nick Starr for the London Theater Company at the Bridge Theatre in June 2018. Produced on Broadway by the Manhattan Theater Club, Lynne Meadow, Artistic Director, Barry Grove, Executive Producer and The London Theater Company, in association with Penguin Random House Audio.© 2016 Elizabeth Strout (P) Penguin Audio 2020"
  },
  {
    "title": "The Dry",
    "author": "Jane Harper",
    "id": "5564001",
    "url": "https://westerncape.overdrive.com/media/5564001",
    "available_copies": 28,
    "owned_copies": 29,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "Amid the worst drought to ravage Australia in a century, a farmer turns his gun on his family and then himself. As questions mount and suspicion casts a long shadow over the parched town, specialist investigator Aaron Falk is forced to confront the community that rejected him twenty years earlier."
  },
  {
    "title": "Force of Nature",
    "author": "Jane Harper",
    "id": "5253170",
    "url": "https://westerncape.overdrive.com/media/5253170",
    "available_copies": 53,
    "owned_copies": 53,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "Federal Police Agent Aaron Falk has a particularly keen interest in the whereabouts of the missing bushwalker. Alice Russell is the whistleblower in his latest case - and Alice knew secrets. About the company she worked for and the people she worked with. In an investigation that takes Falk from corporate heartland to isolated bushland, he discovers that every person on that retreat had something to hide..."
  },
  {
    "title": "Over My Dead Body",
    "author": "Jeffrey Archer",
    "id": "6022942",
    "url": "https://westerncape.overdrive.com/media/6022942",
    "available_copies": 1,
    "owned_copies": 1,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "The gripping new instalment in the William Warwick series, An Eye for an Eye, is available to pre-order now! An unputdownable story of murder, revenge and betrayal from international number one bestseller Jeffrey Archer. THE CLOCK IS TICKING IN THIS ROLLERCOASTER RIDE OF A THRILLER... In London, the Metropolitan Police set up a new Unsolved Murders Unit – a cold case squad – to catch the criminals nobody else can. In Geneva, millionaire art collector Miles Faulkner – convicted of forgery and theft – was pronounced dead two months ago. So why is his unscrupulous lawyer still representing a dead client? On a luxury liner en route to New York, the battle for power at the heart of a wealthy dynasty is about to turn to murder. And at the heart of all three investigations are Detective Chief Inspector William Warwick, rising star of the Met, and ex-undercover operative Ross Hogan, brought in from the cold. But can they catch the killers before it's too late? Praise for Jeffrey Archer: 'Probably the greatest storyteller of our age' Mail on Sunday 'Peerless master of the page turner' Daily Mail 'If there were a Nobel Prize for storytelling, Archer would win' Daily Telegraph 'Archer is a master entertainer' Time Jeffrey Archer's previous novel Nothing Ventured was a No.1 Sunday Times bestseller w/c 28th March 2020."
  },
  {
    "title": "Paris for One",
    "author": "JoJo Moyes",
    "id": "5563736",
    "url": "https://westerncape.overdrive.com/media/5563736",
    "available_copies": 1,
    "owned_copies": 1,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "\"Nell is twenty-six and has never been to Paris. She has never even been on a weekend away with her boyfriend. Everyone knows she is just not the adventurous type. But, when her boyfriend doesn't turn up for their romantic mini-break, Nell has the chance t\""
  },
  {
    "title": "The Last White Man",
    "author": "Mohsin Hamid",
    "id": "7717320",
    "url": "https://westerncape.overdrive.com/media/7717320",
    "available_copies": 1,
    "owned_copies": 1,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "Brought to you by Penguin.From the internationally bestselling author of Exit West, a story of love, loss, and rediscovery in a time of unsettling changeOne morning, Anders wakes to find that his skin has turned dark, his reflection a stranger to him. At first he tells only Oona, an old friend, newly a lover. Soon, reports of similar occurrences surface across the land. Some see in the transformations the long-dreaded overturning of an established order, to be resisted to a bitter end. In many, like Anders's father and Oona's mother, a sense of profound loss wars with profound love. As the bond between Anders and Oona deepens, change takes on a different shading: a chance to see one another, face to face, anew.Praise for Exit West'Hamid's enticing strategy is to foreground the humanity. . . . [He] exploits fiction's capacity to elicit empathy and identification to imagine a better world.' - The New York Times Book Review 'Lyrical and urgent . . . peels away the dross of bigotry to expose the beauty of our common humanity.' - O, the Oprah Magazine 'Powerful, vivid, poignant . . . Hamid is the master' The Sunday Times 'Astonishing' Zadie Smith '[An] exceptionally moving and powerful novel' The Guardian © Mohsin Hamid 2022 (P) Penguin Audio 2022"
  },
  {
    "title": "Moth Smoke",
    "author": "Mohsin Hamid",
    "id": "6132822",
    "url": "https://westerncape.overdrive.com/media/6132822",
    "available_copies": 1,
    "owned_copies": 1,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "Brought to you by Penguin. Discover this surprising gem - the sharp, funny and irresistible debut novel from the bestselling author of Exit West and The Reluctant Fundamentalist'You know you're in trouble when you can't meet a woman's eye, particularly if the woman happens to be your best friend's wife...'In Lahore, Daru Shezad is a junior banker with a hashish habit. When his old friend Ozi moves back to Pakistan, Daru wants to be happy for him. Ozi has everything: a beautiful wife and child, an expensive foreign education - and a corrupt father who bankrolls his lavish lifestyle.As jealousy sets in, Daru's life slowly unravels. He loses his job. Starts lacing his joints with heroin. Becomes involved with a criminally-minded rickshaw driver. And falls in love with Ozi's lonely wife.But how low can Daru sink? Is he guilty of the crime he finds himself on trial for?'Subtly audacious . . . A steamy and often darkly amusing book about sex, drugs, and class warfare in postcolonial Asia' Village Voice© Mohsin Hamid 2000 (P) Penguin Audio 2022"
  },
  {
    "title": "The Mosquito Coast",
    "author": "Paul Theroux",
    "id": "6434792",
    "url": "https://westerncape.overdrive.com/media/6434792",
    "available_copies": 1,
    "owned_copies": 1,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "Allie Fox is going to re-create the world. Abominating the cops, crooks, junkies and scavengers of modern America, he abandons civilization and takes the family to live in the Honduran jungle. There his tortured, messianic genius keeps them alive, his hoarse tirades harrying them through a diseased and dirty Eden towards unimaginable darkness."
  },
  {
    "title": "After the Funeral",
    "author": "Tessa Hadley",
    "id": "9579338",
    "url": "https://westerncape.overdrive.com/media/9579338",
    "available_copies": 1,
    "owned_copies": 1,
    "formats": [
      "OverDrive Listen audiobook",
      "MP3 audiobook"
    ],
    "description": "Brought to you by Penguin.From the incomparable Tessa Hadley, a masterful collection of stories that plumb the depths of everyday life to reveal the shifting tides and hidden undercurrents of ordinary relationshipsIn each of the twelve stories in After the Funeral, small events have huge consequences. Heloise's father died in a car crash when she was a little girl; at a dinner party in her forties, she meets someone connected to that long-ago tragedy. Two estranged sisters cross paths at a posh hotel and pretend not to recognize each other. Janie's bohemian mother plans to marry a man close to Janie's own age - everything changes when an accident interrupts the wedding party. A daughter caring for her elderly mother during the pandemic becomes obsessed with the woman next door; in the wake of his best friend's death, a man must reassess his affair with the friend's wife. Teenager Cecilia wakes one morning on vacation with her parents in Florence and sees them for the first time through disenchanted eyes.As psychologically astute as they are emotionally dense, these stories illuminate the enduring conflicts between responsibility and freedom, power and desire, convention and subversion, reality and dreams. A vital addition to Tessa Hadley's celebrated body of work, After the Funeral bears out Claire Messud's observation that 'Like Alice Munro, to whom she has more than once been compared, Hadley has the gift of making small canvases inexhaustibly new.... Compassionate and luminous, Hadley sees them all - or should I say, she sees us all: our travails, our fantasies and our small joys.'©2023 Tessa Hadley (P)2023 Penguin Audio"
  }
]